In [1]:
import pandas as pd
import numpy as np

In [2]:
students = pd.DataFrame({
    "studentname":['Raja', 'Ram', 'Ganesh', 'Raju', 'Banu', 'Kavi', 'Karthik', 'Anand', 'Raja'],
    "totalmarks":[470, 480, 470, 440, 475, 350, 390, 430, 480],
    "gender":['Male','Male','Male','Female','Female','Female','Male','Male', 'Male'],
    "age":[20,19,20,21,19,20,21,20,22]
    })

In [3]:
students

  studentname  totalmarks  gender  age
0        Raja         470    Male   20
1         Ram         480    Male   19
2      Ganesh         470    Male   20
3        Raju         440  Female   21
4        Banu         475  Female   19
5        Kavi         350  Female   20
6     Karthik         390    Male   21
7       Anand         430    Male   20
8        Raja         480    Male   22

In [4]:
students[students['gender'] == 'Male']

  studentname  totalmarks gender  age
0        Raja         470   Male   20
1         Ram         480   Male   19
2      Ganesh         470   Male   20
6     Karthik         390   Male   21
7       Anand         430   Male   20
8        Raja         480   Male   22

In [5]:
students[students['gender'].isin(['Male'])]

  studentname  totalmarks gender  age
0        Raja         470   Male   20
1         Ram         480   Male   19
2      Ganesh         470   Male   20
6     Karthik         390   Male   21
7       Anand         430   Male   20
8        Raja         480   Male   22

In [6]:
students['gender'].duplicated()

0    False
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8     True
Name: gender, dtype: bool

In [7]:
students['totalmarks'].duplicated().count

<bound method Series.count of 0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8     True
Name: totalmarks, dtype: bool>

In [8]:
students.duplicated('gender')

0    False
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
students.duplicated(['studentname', 'gender'])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
dtype: bool

In [10]:
students.drop_duplicates('studentname', keep='first')

  studentname  totalmarks  gender  age
0        Raja         470    Male   20
1         Ram         480    Male   19
2      Ganesh         470    Male   20
3        Raju         440  Female   21
4        Banu         475  Female   19
5        Kavi         350  Female   20
6     Karthik         390    Male   21
7       Anand         430    Male   20

In [11]:
students.values

array([['Raja', 470, 'Male', 20],
       ['Ram', 480, 'Male', 19],
       ['Ganesh', 470, 'Male', 20],
       ['Raju', 440, 'Female', 21],
       ['Banu', 475, 'Female', 19],
       ['Kavi', 350, 'Female', 20],
       ['Karthik', 390, 'Male', 21],
       ['Anand', 430, 'Male', 20],
       ['Raja', 480, 'Male', 22]], dtype=object)